; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 253392 2 2 3 7 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared2 - mode
	infrared0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Star6 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Phenomenon7 spectrograph1)
	(have_image Star8 infrared2)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon10 infrared2)
	(have_image Planet11 infrared2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 6
5. (turn_to satellite0 star8 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
6. (turn_to satellite1 phenomenon7 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 6
7. (take_image satellite1 phenomenon7 instrument1 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 1 of 6
8. (take_image satellite0 star8 instrument0 infrared2)
   added: (have_image star8 infrared2)
   goals met: 2 of 6
9. (turn_to satellite0 star1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star1)
   goals met: 3 of 6
10. (turn_to satellite0 planet11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet11)
   goals met: 2 of 6
11. (take_image satellite0 planet11 instrument0 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 3 of 6
12. (turn_to satellite0 star1 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star1)
   goals met: 4 of 6
13. (turn_to satellite0 phenomenon9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 6
14. (take_image satellite0 phenomenon9 instrument0 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 4 of 6
15. (turn_to satellite0 star1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star1)
   goals met: 5 of 6
16. (turn_to satellite0 phenomenon10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 6
17. (take_image satellite0 phenomenon10 instrument0 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 5 of 6
18. (turn_to satellite0 star1 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star1)
   goals met: 6 of 6
